In [1]:
import pandas as pd

In [3]:
# criando um dicionario
data = {
    'nome': ['teo', 'nah', 'lara', 'maria'],
    'sobrenome': ['calvo', 'ataide', 'calvo', 'calvo'],
    'idade': [31, 32, 31, 2]
}

data

{'nome': ['teo', 'nah', 'lara', 'maria'],
 'sobrenome': ['calvo', 'ataide', 'calvo', 'calvo'],
 'idade': [31, 32, 31, 2]}

In [5]:
data['idade'][0]

31

In [7]:
#transformando em uma tabela
df = pd.DataFrame(data)
df

    nome sobrenome  idade
0    teo     calvo     31
1    nah    ataide     32
2   lara     calvo     31
3  maria     calvo      2

In [11]:
# usando iloc para garantir que irar trazer a idade na posicao 0
df['idade'].iloc[0]

0    31
1    32
2    31
3     2
Name: idade, dtype: int64

In [19]:
# para saber sobrenomes aqui ele pega uma coluna 
df['sobrenome'][2]

'calvo'

In [23]:
# acessar uma linha
df.iloc[0]

nome           teo
sobrenome    calvo
idade           31
Name: 0, dtype: object

In [26]:
# para saber os nomes das colunas / só serve para dataframe
df.columns

Index(['nome', 'sobrenome', 'idade'], dtype='object')

In [28]:
# para saber os index
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
# resumo de todas as onfprmações
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [32]:
# para saber o tamnho real do arquivo e quanto esta oculpando da memoria ram
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 592.0 bytes

In [36]:
# como asber o tipo de cada coluna
df.dtypes

nome         object
sobrenome    object
idade         int64
dtype: object

In [38]:
# como aplicar algumas condicoes em colunas do tipo int
df.describe()

          idade
count   4.00000
mean   24.00000
std    14.67424
min     2.00000
25%    23.75000
50%    31.00000
75%    31.25000
max    32.00000

In [52]:
# como atribuir uma coluna nova

df['peso'] = [80, 53, 65, 14]

In [50]:
df.describe()

          idade       peso
count   4.00000   4.000000
mean   24.00000  53.000000
std    14.67424  28.248894
min     2.00000  14.000000
25%    23.75000  43.250000
50%    31.00000  59.000000
75%    31.25000  68.750000
max    32.00000  80.000000

In [54]:
# se quiser apenas de uma coluna em especifico a media 
sumario = df.describe()
sumario['peso']['mean']

53.0

In [57]:
# para saber as 5 primeiras
df.head()

    nome sobrenome  idade  peso
0    teo     calvo     31    80
1    nah    ataide     32    53
2   lara     calvo     31    65
3  maria     calvo      2    14

In [59]:
# para saber as ultimas linhas 
df.tail()

    nome sobrenome  idade  peso
0    teo     calvo     31    80
1    nah    ataide     32    53
2   lara     calvo     31    65
3  maria     calvo      2    14